#### Terraform Plan 📖`success`
<details>
<summary>Show Plan</summary>

```terraform
google_service_account.handler-service-account: Refreshing state... [id=projects/dev-voicemail-service/serviceAccounts/dev-voicemail-handler-service@dev-voicemail-service.iam.gserviceaccount.com]
google_secret_manager_secret.secrets: Refreshing state... [id=projects/dev-voicemail-service/secrets/dev-voicemail-secrets]
google_storage_bucket.function-artifacts: Refreshing state... [id=function-artifacts]
google_storage_bucket.voicemail-outputs: Refreshing state... [id=dev-voicemail-outputs-3504688]
google_storage_bucket_object.voicemail-handler-code: Refreshing state... [id=function-artifacts-dev-voicemail-handler/1740525572322.zip]
google_project_iam_member.handler-service-account_roles--logginglogWriter-iam-member_7BAF8DC6: Refreshing state... [id=dev-voicemail-service/roles/logging.logWriter/serviceAccount:dev-voicemail-handler-service@dev-voicemail-service.iam.gserviceaccount.com]
google_storage_bucket_iam_member.voicemail-outputs_0-voicemail-outputs-perms_2535F52E: Refreshing state... [id=b/dev-voicemail-outputs-3504688/roles/storage.objectCreator/serviceAccount:dev-voicemail-handler-service@dev-voicemail-service.iam.gserviceaccount.com]
google_project_iam_member.handler-service-account_roles--secretmanagersecretAccessor-iam-member_2CE899F0: Refreshing state... [id=dev-voicemail-service/roles/secretmanager.secretAccessor/serviceAccount:dev-voicemail-handler-service@dev-voicemail-service.iam.gserviceaccount.com]
google_project_iam_member.handler-service-account_roles--speechclient-iam-member_B4F3C49E: Refreshing state... [id=dev-voicemail-service/roles/speech.client/serviceAccount:dev-voicemail-handler-service@dev-voicemail-service.iam.gserviceaccount.com]
google_cloudfunctions2_function.voicemail-handler: Refreshing state... [id=projects/dev-voicemail-service/locations/us-central1/functions/dev-voicemail-handler]
google_cloud_run_v2_service_iam_member.cloud-run-invoke: Refreshing state... [id=projects/dev-voicemail-service/locations/us-central1/services/dev-voicemail-handler/roles/run.invoker/allUsers]
google_cloudfunctions2_function_iam_member.function-iam: Refreshing state... [id=projects/dev-voicemail-service/locations/us-central1/functions/dev-voicemail-handler/roles/cloudfunctions.invoker/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions2_function.voicemail-handler will be updated in-place
  ~ resource "google_cloudfunctions2_function" "voicemail-handler" {
        id               = "projects/dev-voicemail-service/locations/us-central1/functions/dev-voicemail-handler"
        name             = "dev-voicemail-handler"
        # (11 unchanged attributes hidden)

      ~ build_config {
          ~ runtime               = "nodejs20" -> "nodejs22"
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "dev-voicemail-handler/1740525572322.zip" -> "dev-voicemail-handler/1750957000734.zip"
                    # (2 unchanged attributes hidden)
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_object.voicemail-handler-code must be replaced
-/+ resource "google_storage_bucket_object" "voicemail-handler-code" {
      + content             = (sensitive value)
      ~ content_type        = "application/zip" -> (known after apply)
      ~ crc32c              = "z2XZVQ==" -> (known after apply)
      ~ detect_md5hash      = "14C0esPKKcG1hJJPmscVWA==" -> "different hash"
      - event_based_hold    = false -> null
      ~ generation          = 1740525577943941 -> (known after apply)
      ~ id                  = "function-artifacts-dev-voicemail-handler/1740525572322.zip" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "14C0esPKKcG1hJJPmscVWA==" -> (known after apply)
      ~ md5hexhash          = "d780b47ac3ca29c1b584924f9ac71558" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/function-artifacts/o/dev-voicemail-handler%2F1740525572322.zip?generation=1740525577943941&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "dev-voicemail-handler/1740525572322.zip" -> "dev-voicemail-handler/1750957000734.zip" # forces replacement
      ~ output_name         = "dev-voicemail-handler/1740525572322.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/function-artifacts/o/dev-voicemail-handler%2F1740525572322.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan"
```

</details>

* Pusher: @sstawiarski
* Action: `pull_request`
* Workflow: `Comment Terraform Plan on PR`